The selected fitting has invalid connections and must be deleted to continue.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId InvalidConnectionRef { get; }
  Visual Basic
Public Shared ReadOnly Property InvalidConnectionRef As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InvalidConnectionRef {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ConnectorFailures Class
  Autodesk.Revit.DB Namespace